drmpf/pfodWeb_src/variants/rp2040/rp2040/ilabs_rpico32/pins_arduino.h
#pragma once

// pfodWeb NOTE: this board has an add-on WiFi/BLE co-processor (not the
// native RP2040/RP2350 + CYW43439 combo that Pico W/2W use), so it stays
// Serial-only for now — variants/rp2040/tcp.ino, http.ino and ble.ino
// only work with the native cyw43 WiFi.h stack (see variants/rp2040w/
// for those boards). This board would need its own dedicated .ino
// templates written for its specific co-processor/protocol before it
// could offer tcp/http/ble connections.
#ifdef __cplusplus
#include <Ilabs2040WiFiClass.h>
#endif

#define PINS_COUNT          (26u)
#define NUM_DIGITAL_PINS    (26u)
#define NUM_ANALOG_INPUTS   (4u)
#define NUM_ANALOG_OUTPUTS  (0u)
#define ADC_RESOLUTION      (12u)

// Connected to ESP8285
#define PIN_SERIAL1_TX      (0u)
#define PIN_SERIAL1_RX      (1u)
#define PIN_ESP_RESET       (2u)
#define PIN_ESP_MODE        (3u)
#define PIN_ESP_TXD         PIN_SERIAL1_TX
#define PIN_ESP_RXD         PIN_SERIAL1_RX
#define ESP_SERIAL_PORT     Serial1

// Serial
#define PIN_SERIAL2_TX      (8u)
#define PIN_SERIAL2_RX      (9u)

// SPI
#define PIN_SPI0_MISO       (24u)
#define PIN_SPI0_MOSI       (23u)
#define PIN_SPI0_SCK        (22u)
#define PIN_SPI0_SS         (21u)

// Not pinned out
#define PIN_SPI1_MISO       (31u)
#define PIN_SPI1_MOSI       (31u)
#define PIN_SPI1_SCK        (31u)
#define PIN_SPI1_SS         (31u)

// Wire
#define PIN_WIRE0_SDA       (4u)
#define PIN_WIRE0_SCL       (5u)

// Not pinned out
#define PIN_WIRE1_SDA       (31u)
#define PIN_WIRE1_SCL       (31u)

#define SERIAL_HOWMANY      (2u)
#define SPI_HOWMANY         (1u)
#define WIRE_HOWMANY        (1u)

// pfodWeb NOTE: D0-D3 deliberately NOT declared (the vendor's own file
// marks them "Internal to the board") — GPIO0/1 are the UART to the
// onboard ESP8285 WiFi co-processor (PIN_SERIAL1_TX/RX), GPIO2/3 are its
// PIN_ESP_RESET/PIN_ESP_MODE control lines. Not general-purpose.
static const uint8_t D4 = (4u);
static const uint8_t D5 = (5u);
static const uint8_t D6 = (6u);
static const uint8_t D7 = (7u);
static const uint8_t D8 = (8u);
static const uint8_t D9 = (9u);
static const uint8_t D10 = (10u);
static const uint8_t D11 = (11u);
static const uint8_t D12 = (12u);
static const uint8_t D13 = (13u);
static const uint8_t D14 = (14u);
static const uint8_t D15 = (15u);
static const uint8_t D16 = (16u);
static const uint8_t D17 = (17u);
static const uint8_t D18 = (18u);
static const uint8_t D19 = (19u);
static const uint8_t D20 = (20u);
static const uint8_t D21 = (21u);
static const uint8_t D22 = (22u);
static const uint8_t D23 = (23u);
static const uint8_t D24 = (24u);
static const uint8_t D25 = (25u);
static const uint8_t D26 = (26u);
static const uint8_t D27 = (27u);
static const uint8_t D28 = (28u);
static const uint8_t D29 = (29u);

static const uint8_t A0 = (26u);
static const uint8_t A1 = (27u);
static const uint8_t A2 = (28u);
static const uint8_t A3 = (29u);
